# Lecture 20 - Connecting to SQL via Python 

<font size = "5">

In the past lecture:

- We worked directly in SQL
- Carried out basic dataset operations

In  this lecture we will run SQL from Python

- Combine the best of both!
- Learn about escape characters!

# I. Import Libraries and Data

<font size = "5">

Import libraries

In [1]:
# psycogpg2 helps us process SQL commands to send to the server
# sqlalchemy facilitates establishing a connection with the server

import pandas as pd
import psycopg2
from sqlalchemy import create_engine, text

<font size = "5">

Connect to SQL server

- In the default instructions we set <br>
the password to "" in windows and <br>
no password for Mac
- ADJUST code accordingly!

In [2]:
# Use the connection details to your server
# These are the default settings.
# "postgresql" is a fixed argument
# If you have a different host,database, username, or password,
# change the corresponding connection details

engine = create_engine('postgresql+psycopg2://postgres:postgres@localhost:5432/postgres')
conn = engine.connect()

Example tables:

In [3]:
# Rollback the transaction
conn.rollback()

# Drop the tables if they already exist
conn.execute(text('''
DROP TABLE IF EXISTS famous_people CASCADE
'''))

conn.execute(text('''
DROP TABLE IF EXISTS information CASCADE
'''))

# Create tables in the SQL database
conn.execute(text('''
CREATE TABLE IF NOT EXISTS famous_people (
    person_id INTEGER PRIMARY KEY,
    name TEXT
)
'''))

conn.execute(text('''
CREATE TABLE IF NOT EXISTS information (
    person_id INTEGER,
    country TEXT,
    profession TEXT,
    FOREIGN KEY (person_id) REFERENCES famous_people (person_id)
)
'''))

# Insert data into the tables
conn.execute(text('''
INSERT INTO famous_people (person_id, name)
VALUES (1, 'Albert Einstein'),
       (2, 'Isaac Newton'),
       (3, 'Marie Curie'),
       (4, 'Galileo Galilei'),
       (5, 'René Descartes'),
       (6, 'Blaise Pascal'),
       (7, 'Nikola Tesla')
'''))

conn.execute(text('''
INSERT INTO information (person_id, country, profession)
VALUES (1, 'Germany', 'Physicist'),
       (2, 'United Kingdom', 'Mathematician'),
       (3, 'Poland', 'Physicist'),
       (4, 'Italy', 'Astronomer'),
       (5, 'France', 'Philosopher'),
       (6, 'France', 'Mathematician')
'''))

conn.commit()

In [4]:
# Rollback any existing transactions
conn.rollback()

# Query the database
famous_people = pd.read_sql('SELECT * FROM famous_people', conn)
information = pd.read_sql('SELECT * FROM information', conn)

# Display the results
display(famous_people)
display(information)

# Close the connection
conn.close()

   person_id             name
0          1  Albert Einstein
1          2     Isaac Newton
2          3      Marie Curie
3          4  Galileo Galilei
4          5   René Descartes
5          6    Blaise Pascal
6          7     Nikola Tesla

   person_id         country     profession
0          1         Germany      Physicist
1          2  United Kingdom  Mathematician
2          3          Poland      Physicist
3          4           Italy     Astronomer
4          5          France    Philosopher
5          6          France  Mathematician

In [5]:
# Join the two tables
conn = engine.connect()

# Rollback any existing transactions
conn.rollback()

# Query the database
pd.read_sql('''
SELECT *
FROM famous_people
LEFT JOIN information
ON famous_people.person_id = information.person_id
''', conn)

   person_id             name  person_id         country     profession
0          1  Albert Einstein        1.0         Germany      Physicist
1          2     Isaac Newton        2.0  United Kingdom  Mathematician
2          3      Marie Curie        3.0          Poland      Physicist
3          4  Galileo Galilei        4.0           Italy     Astronomer
4          5   René Descartes        5.0          France    Philosopher
5          6    Blaise Pascal        6.0          France  Mathematician
6          7     Nikola Tesla        NaN            None           None

# II. Entity Relationship Diagrams 

<font size = "5">

United States Congress dataset

- Bills and actions
- US congress members

<font size = "5">

Read datasets into Python

In [6]:
bills_actions       = pd.read_csv("data_raw/bills_actions.csv")
us_congress_members = pd.read_csv("data_raw/us_congress_members.csv")

<font size = "5">

Upload to SQL

In [7]:
# Recreate the connection
conn = engine.connect()

# Rollback any existing transactions
conn.rollback()

# Drop the tables if they already exist
conn.execute(text('''
DROP TABLE IF EXISTS bills_actions CASCADE
'''))
conn.commit()

bills_actions.to_sql('bills_actions',
               con = conn,
               if_exists='replace',
               index=False)

conn.commit()

In [8]:
# Recreate the connection
conn = engine.connect()

# Rollback any existing transactions
conn.rollback()

# Drop the tables if they already exist
conn.execute(text('''
DROP TABLE IF EXISTS us_congress_members CASCADE
'''))
conn.commit()

# Import "races"
us_congress_members.to_sql('us_congress_members', 
             con = conn, 
             if_exists='replace',
             index=False)

conn.commit()

<font size = "5">

Download from SQL Server

In [9]:
# Recreate the connection
conn = engine.connect()

# Rollback any existing transactions
conn.rollback()

# Check if the table exists
pd.read_sql(text('SELECT * FROM bills_actions'), conn)

,congress,bill_number,bill_type,action,main_action,object,member_id
0,116,1029,s,S.Amdt.1274 Amendment SA 1274 proposed by Sena...,senate amendment proposed (on the floor),amendment,858
1,116,1031,s,S.Amdt.2698 Amendment SA 2698 proposed by Sena...,senate amendment proposed (on the floor),amendment,675
2,116,1160,s,S.Amdt.2659 Amendment SA 2659 proposed by Sena...,senate amendment proposed (on the floor),amendment,858
3,116,1199,s,"Committee on Health, Education, Labor, and Pen...",senate committee/subcommittee actions,senate bill,1561
4,116,1208,s,Committee on the Judiciary. Reported by Senato...,senate committee/subcommittee actions,senate bill,1580
...,...,...,...,...,...,...,...
3298,116,9,hr,H.Amdt.172 Amendment (A004) offered by Ms. Kus...,house amendment offered,amendment,36
3299,116,9,hr,H.Amdt.171 Amendment (A003) offered by Ms. Hou...,house amendment offered,amendment,186
3300,116,9,hr,H.Amdt.170 Amendment (A002) offered by Ms. Oma...,house amendment offered,amendment,477
3301,116,9,hr,POSTPONED PROCEEDINGS - At the conclusion of d...,other house amendment actions,amendment,393
3302,116,9,hr,H.Amdt.169 Amendment (A001) offered by Mr. Esp...,house amendment offered,amendment,6

<font size = "5">

Try it yourself

Download and display the "us_congress_members" dataset from SQL

In [ ]:
# Write your own code

# III. Merge Dataset 

<font size = "5">

The following is an example of an entity relationship diagram (ERD)

<font size = "5">

<img src="figures/rdb_us_congress.png" alt="drawing" width="650"/>

- Here "member_id" is the PRIMARY KEY of the first dataset
- We can check that with SQL commands

In [10]:
summary = pd.read_sql(text("SELECT COUNT(DISTINCT member_id) AS num_distinct, \
                           COUNT(*) AS num_members   \
                           FROM us_congress_members"),
                      conn)

summary

   num_distinct  num_members
0          1811         1811

<font size = "5">

Merge two datasets

- Similar to python
- FROM is followed by the name of the primary dataset
- LEFT is followed by the name of the secondary dataset
- ON is the id variable used for merging

In [ ]:
# Write your own code

<font size = "5">

And that's all for today! :)

<font size = "4">

The code below is just to ensure that, if everything else fails, we can drop all tables and start from scratch. No need to run it if everything is working fine.

In [ ]:
from sqlalchemy import create_engine, text, inspect
import time

engine = create_engine('postgresql+psycopg2://postgres:postgres@localhost:5432/postgres', future=True)
connection = engine.connect()

def clean_database(engine):
    with engine.connect() as conn:
        try:
            # Get inspector to check existing tables
            inspector = inspect(engine)
            existing_tables = inspector.get_table_names()
            
            if not existing_tables:
                print("No tables found in database")
                return
                
            print(f"Found {len(existing_tables)} tables: {existing_tables}")
            
            # Kill other connections
            conn.execute(text("""
                SELECT pg_terminate_backend(pid) 
                FROM pg_stat_activity 
                WHERE pid <> pg_backend_pid()
                AND datname = current_database()
            """))
            
            conn.execute(text("ROLLBACK"))
            conn.execute(text("SET statement_timeout = '30s'"))
            
            # Only drop tables that exist
            for table in existing_tables:
                try:
                    conn.execute(text(f"DROP TABLE IF EXISTS {table} CASCADE"))
                    print(f"Dropped {table}")
                    conn.commit()
                    time.sleep(1)
                except Exception as e:
                    print(f"Error with {table}: {str(e)}")
                    conn.execute(text("ROLLBACK"))
                    
        except Exception as e:
            print(f"Fatal error: {str(e)}")
            conn.execute(text("ROLLBACK"))

# Execute
clean_database(engine)

# IV. (Optional) Additional Resources 


<font size = "5">

SQL in 100 seconds:

https://www.youtube.com/watch?v=zsjvFFKOm3c

Overview of SQL:

https://www.youtube.com/watch?v=27axs9dO7AE

Introduction to databases:

https://www.youtube.com/watch?v=wR0jg0eQsZA

Introduction to Entity Relationship Diagrams

https://www.youtube.com/watch?v=wR0jg0eQsZA